{"config": {"layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 256, 256, 1], "sparse": false, "name": "input_3"}, "inbound_nodes": [], "name": "input_3", "class_name": "InputLayer"}, {"config": {"padding": "same", "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "filters": 64, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_204", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [2, 2]}, "inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "conv2d_204", "class_name": "Conv2D"}, {"config": {"padding": "same", "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "filters": 128, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_205", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "inbound_nodes": [[["conv2d_204", 0, 0, {}]]], "name": "conv2d_205", "class_name": "Conv2D"}, {"config": {"padding": "same", "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "filters": 128, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_206", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [2, 2]}, "inbound_nodes": [[["conv2d_205", 0, 0, {}]]], "name": "conv2d_206", "class_name": "Conv2D"}, {"config": {"padding": "same", "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "filters": 256, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_207", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "inbound_nodes": [[["conv2d_206", 0, 0, {}]]], "name": "conv2d_207", "class_name": "Conv2D"}, {"config": {"padding": "same", "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "filters": 256, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_208", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [2, 2]}, "inbound_nodes": [[["conv2d_207", 0, 0, {}]]], "name": "conv2d_208", "class_name": "Conv2D"}, {"config": {"dtype": "float32", "batch_input_shape": [null, 1000], "sparse": false, "name": "input_2"}, "inbound_nodes": [], "name": "input_2", "class_name": "InputLayer"}, {"config": {"padding": "same", "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "filters": 512, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_209", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "inbound_nodes": [[["conv2d_208", 0, 0, {}]]], "name": "conv2d_209", "class_name": "Conv2D"}, {"config": {"trainable": true, "n": 1024, "name": "repeat_vector_1"}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "repeat_vector_1", "class_name": "RepeatVector"}, {"config": {"padding": "same", "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "filters": 512, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_210", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "inbound_nodes": [[["conv2d_209", 0, 0, {}]]], "name": "conv2d_210", "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "reshape_1", "target_shape": [32, 32, 1000]}, "inbound_nodes": [[["repeat_vector_1", 0, 0, {}]]], "name": "reshape_1", "class_name": "Reshape"}, {"config": {"padding": "same", "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "filters": 256, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_211", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "inbound_nodes": [[["conv2d_210", 0, 0, {}]]], "name": "conv2d_211", "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "concatenate_1", "axis": 3}, "inbound_nodes": [[["reshape_1", 0, 0, {}], ["conv2d_211", 0, 0, {}]]], "name": "concatenate_1", "class_name": "Concatenate"}, {"config": {"padding": "valid", "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "filters": 256, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu", "kernel_size": [1, 1], "use_bias": true, "name": "conv2d_212", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "conv2d_212", "class_name": "Conv2D"}, {"config": {"padding": "same", "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "filters": 128, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_213", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "inbound_nodes": [[["conv2d_212", 0, 0, {}]]], "name": "conv2d_213", "class_name": "Conv2D"}, {"config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_1"}, "inbound_nodes": [[["conv2d_213", 0, 0, {}]]], "name": "up_sampling2d_1", "class_name": "UpSampling2D"}, {"config": {"padding": "same", "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "filters": 64, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_214", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]], "name": "conv2d_214", "class_name": "Conv2D"}, {"config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_2"}, "inbound_nodes": [[["conv2d_214", 0, 0, {}]]], "name": "up_sampling2d_2", "class_name": "UpSampling2D"}, {"config": {"padding": "same", "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_215", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "name": "conv2d_215", "class_name": "Conv2D"}, {"config": {"padding": "same", "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "filters": 16, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_216", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "inbound_nodes": [[["conv2d_215", 0, 0, {}]]], "name": "conv2d_216", "class_name": "Conv2D"}, {"config": {"padding": "same", "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "filters": 2, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "tanh", "kernel_size": [2, 2], "use_bias": true, "name": "conv2d_217", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "inbound_nodes": [[["conv2d_216", 0, 0, {}]]], "name": "conv2d_217", "class_name": "Conv2D"}, {"config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_3"}, "inbound_nodes": [[["conv2d_217", 0, 0, {}]]], "name": "up_sampling2d_3", "class_name": "UpSampling2D"}], "output_layers": [["up_sampling2d_3", 0, 0]], "name": "model_1", "input_layers": [["input_3", 0, 0], ["input_2", 0, 0]]}, "keras_version": "2.1.5", "backend": "tensorflow", "class_name": "Model"}